---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.ArrayingNotSupportedForElements
source: html/55686746-f5ca-2547-0e1d-c96212d46127.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.ArrayingNotSupportedForElements Property

Arraying is not currently supported for the selected elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId ArrayingNotSupportedForElements { get; }
```